ProCodeGuide.Samples.ThreadPoolConfig/Load Tests/results.txt
 1 Prozessor 8 Kerne 16 logische Prozessoren i9 CPU
   "minWorkerThreads": 16,
  "minCompletionPortThreads": 16,
  "maxWorkerThreads": 32767,
  "maxCompletionPortThreads": 1000
}

200 ms Delay

100 Sync
 data_received..................: 3.9 MB 48 kB/s
     data_sent......................: 606 kB 7.5 kB/s
     http_req_blocked...............: avg=7.78µs   min=1µs      med=3µs      max=551µs    p(90)=5µs      p(95)=9µs     
     http_req_connecting............: avg=3.28µs   min=0s       med=0s       max=282µs    p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=201.07ms min=200.22ms med=201.2ms  max=241.08ms p(90)=201.5ms  p(95)=201.55ms
       { expected_response:true }...: avg=201.07ms min=200.22ms med=201.2ms  max=241.08ms p(90)=201.5ms  p(95)=201.55ms
     http_req_failed................: 0.00%  ✓ 0         ✗ 5884 
     http_req_receiving.............: avg=39.78µs  min=13µs     med=35µs     max=230µs    p(90)=58µs     p(95)=69µs    
     http_req_sending...............: avg=13.85µs  min=5µs      med=11µs     max=110µs    p(90)=22µs     p(95)=28µs    
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=201.02ms min=200.17ms med=201.15ms max=240.9ms  p(90)=201.44ms p(95)=201.49ms
     http_reqs......................: 5884   72.801745/s
     iteration_duration.............: avg=1.2s     min=1.2s     med=1.2s     max=1.24s    p(90)=1.2s     p(95)=1.2s    
     iterations.....................: 5884   72.801745/s
     vus............................: 7      min=7       max=100
     vus_max........................: 100    min=100     max=100

100 Async
 data_received..................: 3.8 MB 48 kB/s
     data_sent......................: 610 kB 7.5 kB/s
     http_req_blocked...............: avg=8.05µs   min=1µs      med=3µs      max=524µs    p(90)=6µs      p(95)=11µs    
     http_req_connecting............: avg=3.29µs   min=0s       med=0s       max=257µs    p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=202.29ms min=199.38ms med=201.92ms max=218.28ms p(90)=204.93ms p(95)=205.45ms
       { expected_response:true }...: avg=202.29ms min=199.38ms med=201.92ms max=218.28ms p(90)=204.93ms p(95)=205.45ms
     http_req_failed................: 0.00%  ✓ 0         ✗ 5867 
     http_req_receiving.............: avg=38.15µs  min=13µs     med=34µs     max=3.95ms   p(90)=51µs     p(95)=60µs    
     http_req_sending...............: avg=14.52µs  min=5µs      med=11µs     max=119µs    p(90)=25µs     p(95)=30µs    
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=202.24ms min=199.34ms med=201.87ms max=214.27ms p(90)=204.88ms p(95)=205.4ms 
     http_reqs......................: 5867   72.589589/s
     iteration_duration.............: avg=1.2s     min=1.19s    med=1.2s     max=1.22s    p(90)=1.2s     p(95)=1.2s    
     iterations.....................: 5867   72.589589/s
     vus............................: 6      min=6       max=100
     vus_max........................: 100    min=100     max=100


1000ms Delay

Sync
 data_received..................: 1.3 MB 16 kB/s
     data_sent......................: 201 kB 2.5 kB/s
     http_req_blocked...............: avg=16.85µs min=1µs  med=3µs  max=553µs p(90)=6µs  p(95)=210µs  
     http_req_connecting............: avg=10.47µs min=0s   med=0s   max=273µs p(90)=0s   p(95)=162.5µs
     http_req_duration..............: avg=2.66s   min=1s   med=2.3s max=6s    p(90)=4.7s p(95)=5.08s  
       { expected_response:true }...: avg=2.66s   min=1s   med=2.3s max=6s    p(90)=4.7s p(95)=5.08s  
     http_req_failed................: 0.00%  ✓ 0         ✗ 1951 
     http_req_receiving.............: avg=35.92µs min=11µs med=29µs max=460µs p(90)=60µs p(95)=75µs   
     http_req_sending...............: avg=14.9µs  min=4µs  med=9µs  max=222µs p(90)=30µs p(95)=43µs   
     http_req_tls_handshaking.......: avg=0s      min=0s   med=0s   max=0s    p(90)=0s   p(95)=0s     
     http_req_waiting...............: avg=2.66s   min=1s   med=2.3s max=6s    p(90)=4.7s p(95)=5.08s  
     http_reqs......................: 1951   23.887087/s
     iteration_duration.............: avg=3.66s   min=2s   med=3.3s max=7s    p(90)=5.7s p(95)=6.08s  
     iterations.....................: 1951   23.887087/s
     vus............................: 4      min=4       max=100
     vus_max........................: 100    min=100     max=100

Async 
 data_received..................: 2.3 MB 29 kB/s
     data_sent......................: 369 kB 4.6 kB/s
     http_req_blocked...............: avg=11.32µs min=1µs      med=3µs  max=601µs  p(90)=6µs  p(95)=18µs
     http_req_connecting............: avg=5.65µs  min=0s       med=0s   max=247µs  p(90)=0s   p(95)=0s  
     http_req_duration..............: avg=1s      min=999.43ms med=1s   max=1.01s  p(90)=1s   p(95)=1s  
       { expected_response:true }...: avg=1s      min=999.43ms med=1s   max=1.01s  p(90)=1s   p(95)=1s  
     http_req_failed................: 0.00%  ✓ 0         ✗ 3550 
     http_req_receiving.............: avg=40.57µs min=14µs     med=36µs max=4.19ms p(90)=53µs p(95)=61µs
     http_req_sending...............: avg=15.64µs min=6µs      med=13µs max=83µs   p(90)=27µs p(95)=33µs
     http_req_tls_handshaking.......: avg=0s      min=0s       med=0s   max=0s     p(90)=0s   p(95)=0s  
     http_req_waiting...............: avg=1s      min=999.36ms med=1s   max=1.01s  p(90)=1s   p(95)=1s  
     http_reqs......................: 3550   43.807331/s
     iteration_duration.............: avg=2s      min=1.99s    med=2s   max=2.02s  p(90)=2s   p(95)=2s  
     iterations.....................: 3550   43.807331/s
     vus............................: 1      min=1       max=100
     vus_max........................: 100    min=100     max=100

5s Delay
Wichtige Werte:
http_req_duration: Gesamtdauer des Requests
iterations: Anzahl der Durchläufe
iteration_duration: Durchnittliche Dauer pro Durchlauf

GetSync 100
  data_received..................: 249 kB 2.8 kB/s
     data_sent......................: 39 kB  441 B/s
     http_req_blocked...............: avg=93.98µs min=2µs  med=5µs    max=1.4ms  p(90)=330.79µs p(95)=397.19µs
     http_req_connecting............: avg=69.39µs min=0s   med=0s     max=608µs  p(90)=260.6µs  p(95)=322.19µs
     http_req_duration..............: avg=19s     min=5s   med=17.56s max=28.19s p(90)=27.91s   p(95)=28.19s  
       { expected_response:true }...: avg=19s     min=5s   med=17.56s max=28.19s p(90)=27.91s   p(95)=28.19s  
     http_req_failed................: 0.00%  ✓ 0        ✗ 379  
     http_req_receiving.............: avg=59.05µs min=22µs med=48µs   max=280µs  p(90)=98.19µs  p(95)=121.09µs
     http_req_sending...............: avg=33.77µs min=8µs  med=24µs   max=266µs  p(90)=56.2µs   p(95)=96.19µs 
     http_req_tls_handshaking.......: avg=0s      min=0s   med=0s     max=0s     p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=19s     min=5s   med=17.56s max=28.19s p(90)=27.91s   p(95)=28.19s  
     http_reqs......................: 379    4.278335/s
     iteration_duration.............: avg=20s     min=6s   med=18.56s max=29.19s p(90)=28.91s   p(95)=29.19s  
     iterations.....................: 379    4.278335/s
     vus............................: 2      min=2      max=100
     vus_max........................: 100    min=100    max=100

GetAsync 100

 data_received..................: 801 kB 9.4 kB/s
     data_sent......................: 127 kB 1.5 kB/s
     http_req_blocked...............: avg=32.67µs min=2µs   med=5µs  max=1.19ms p(90)=16.1µs p(95)=283.14µs
     http_req_connecting............: avg=21.62µs min=0s    med=0s   max=485µs  p(90)=0s     p(95)=231.14µs
     http_req_duration..............: avg=5s      min=4.99s med=5s   max=5.02s  p(90)=5s     p(95)=5s      
       { expected_response:true }...: avg=5s      min=4.99s med=5s   max=5.02s  p(90)=5s     p(95)=5s      
     http_req_failed................: 0.00%  ✓ 0         ✗ 1220 
     http_req_receiving.............: avg=75.61µs min=36µs  med=66µs max=4.25ms p(90)=103µs  p(95)=119.04µs
     http_req_sending...............: avg=26.43µs min=12µs  med=24µs max=100µs  p(90)=40µs   p(95)=49µs    
     http_req_tls_handshaking.......: avg=0s      min=0s    med=0s   max=0s     p(90)=0s     p(95)=0s      
     http_req_waiting...............: avg=5s      min=4.99s med=5s   max=5.02s  p(90)=5s     p(95)=5s      
     http_reqs......................: 1220   14.356823/s
     iteration_duration.............: avg=6s      min=6s    med=6s   max=6.02s  p(90)=6s     p(95)=6s      
     iterations.....................: 1220   14.356823/s
     vus............................: 10     min=10      max=100
     vus_max........................: 100    min=100     max=100



ändere Threadnummer
 ThreadPool.SetMinThreads(100, 100);
 "minWorkerThreads": 100,
  "minCompletionPortThreads": 100,
  "maxWorkerThreads": 32767,
  "maxCompletionPortThreads": 1000


GetSync 100: 
  data_received..................: 656 kB 11 kB/s
     data_sent......................: 103 kB 1.7 kB/s
     http_req_blocked...............: avg=431.66µs min=1µs  med=4µs  max=4.89ms p(90)=274.3µs p(95)=4.43ms  
     http_req_connecting............: avg=319.27µs min=0s   med=0s   max=3.78ms p(90)=80.1µs  p(95)=3.32ms  
     http_req_duration..............: avg=5s       min=5s   med=5s   max=6s     p(90)=5s      p(95)=5.01s   
       { expected_response:true }...: avg=5s       min=5s   med=5s   max=6s     p(90)=5s      p(95)=5.01s   
     http_req_failed................: 0.00%  ✓ 0         ✗ 1000 
     http_req_receiving.............: avg=59.12µs  min=20µs med=44µs max=488µs  p(90)=105µs   p(95)=133µs   
     http_req_sending...............: avg=45.58µs  min=7µs  med=17µs max=794µs  p(90)=90.1µs  p(95)=207.04µs
     http_req_tls_handshaking.......: avg=0s       min=0s   med=0s   max=0s     p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=5s       min=5s   med=5s   max=6s     p(90)=5s      p(95)=5.01s   
     http_reqs......................: 1000   16.385165/s
     iteration_duration.............: avg=6s       min=6s   med=6s   max=7s     p(90)=6s      p(95)=6.01s   
     iterations.....................: 1000   16.385165/s
     vus............................: 1      min=1       max=100
     vus_max........................: 100    min=100     max=100

GetAsync 100

  data_received..................: 656 kB 11 kB/s
     data_sent......................: 104 kB 1.7 kB/s
     http_req_blocked...............: avg=321.27µs min=1µs  med=3µs  max=3.76ms p(90)=1.3ms   p(95)=3.24ms  
     http_req_connecting............: avg=228.77µs min=0s   med=0s   max=2.87ms p(90)=122.3µs p(95)=2.2ms   
     http_req_duration..............: avg=5s       min=5s   med=5s   max=5.03s  p(90)=5.01s   p(95)=5.03s   
       { expected_response:true }...: avg=5s       min=5s   med=5s   max=5.03s  p(90)=5.01s   p(95)=5.03s   
     http_req_failed................: 0.00%  ✓ 0         ✗ 1000 
     http_req_receiving.............: avg=47.03µs  min=16µs med=36µs max=620µs  p(90)=73.1µs  p(95)=103.04µs
     http_req_sending...............: avg=75.94µs  min=6µs  med=16µs max=1.14ms p(90)=227µs   p(95)=337.04µs
     http_req_tls_handshaking.......: avg=0s       min=0s   med=0s   max=0s     p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=5s       min=5s   med=5s   max=5.03s  p(90)=5.01s   p(95)=5.03s   
     http_reqs......................: 1000   16.640676/s
     iteration_duration.............: avg=6s       min=6s   med=6s   max=6.04s  p(90)=6.01s   p(95)=6.03s   
     iterations.....................: 1000   16.640676/s
     vus............................: 100    min=100     max=100
     vus_max........................: 100    min=100     max=100


GetSync 200

     data_received..................: 1.2 MB 14 kB/s
     data_sent......................: 181 kB 2.1 kB/s
     http_req_blocked...............: avg=45.93µs min=1µs  med=3µs   max=875µs  p(90)=263.4µs p(95)=369.99µs
     http_req_connecting............: avg=31.91µs min=0s   med=0s    max=529µs  p(90)=203.4µs p(95)=289.59µs
     http_req_duration..............: avg=7.48s   min=5s   med=7.69s max=12.34s p(90)=8.95s   p(95)=8.98s   
       { expected_response:true }...: avg=7.48s   min=5s   med=7.69s max=12.34s p(90)=8.95s   p(95)=8.98s   
     http_req_failed................: 0.00%  ✓ 0       ✗ 1757 
     http_req_receiving.............: avg=51.16µs min=14µs med=42µs  max=387µs  p(90)=87µs    p(95)=107µs   
     http_req_sending...............: avg=29.98µs min=5µs  med=15µs  max=393µs  p(90)=72µs    p(95)=102µs   
     http_req_tls_handshaking.......: avg=0s      min=0s   med=0s    max=0s     p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=7.48s   min=5s   med=7.69s max=12.34s p(90)=8.95s   p(95)=8.98s   
     http_reqs......................: 1757   20.5786/s
     iteration_duration.............: avg=8.49s   min=6s   med=8.69s max=13.34s p(90)=9.95s   p(95)=9.98s   
     iterations.....................: 1757   20.5786/s
     vus............................: 2      min=2     max=200
     vus_max........................: 200    min=200   max=200


GetAsync 200

 data_received..................: 1.6 MB 19 kB/s
     data_sent......................: 254 kB 3.0 kB/s
     http_req_blocked...............: avg=35.58µs min=2µs   med=5µs  max=1.1ms p(90)=19µs p(95)=328.04µs
     http_req_connecting............: avg=23.18µs min=0s    med=0s   max=559µs p(90)=0s   p(95)=253µs   
     http_req_duration..............: avg=5s      min=4.99s med=5s   max=5s    p(90)=5s   p(95)=5s      
       { expected_response:true }...: avg=5s      min=4.99s med=5s   max=5s    p(90)=5s   p(95)=5s      
     http_req_failed................: 0.00%  ✓ 0        ✗ 2440 
     http_req_receiving.............: avg=67.77µs min=27µs  med=62µs max=314µs p(90)=97µs p(95)=113µs   
     http_req_sending...............: avg=27.75µs min=9µs   med=22µs max=169µs p(90)=47µs p(95)=67µs    
     http_req_tls_handshaking.......: avg=0s      min=0s    med=0s   max=0s    p(90)=0s   p(95)=0s      
     http_req_waiting...............: avg=5s      min=4.99s med=5s   max=5s    p(90)=5s   p(95)=5s      
     http_reqs......................: 2440   28.70126/s
     iteration_duration.............: avg=6s      min=5.99s med=6s   max=6s    p(90)=6s   p(95)=6s      
     iterations.....................: 2440   28.70126/s
     vus............................: 1      min=1      max=200
     vus_max........................: 200    min=200    max=200

GetSync 1000

 data_received..................: 1.4 MB 13 kB/s
     data_sent......................: 251 kB 2.3 kB/s
     http_req_blocked...............: avg=1.64s   min=0s   med=3µs    max=13.11s p(90)=13.1s  p(95)=13.1s   
     http_req_connecting............: avg=1.64s   min=0s   med=0s     max=13.11s p(90)=13.1s  p(95)=13.1s   
     http_req_duration..............: avg=27s     min=0s   med=24.7s  max=59.63s p(90)=43.63s p(95)=57.36s  
       { expected_response:true }...: avg=30.86s  min=5s   med=33.48s max=59.63s p(90)=43.64s p(95)=57.36s  
     http_req_failed................: 12.50% ✓ 299       ✗ 2093  
     http_req_receiving.............: avg=32.58µs min=0s   med=27µs   max=197µs  p(90)=62µs   p(95)=79µs    
     http_req_sending...............: avg=78.53µs min=0s   med=38µs   max=1.32ms p(90)=140µs  p(95)=329.44µs
     http_req_tls_handshaking.......: avg=0s      min=0s   med=0s     max=0s     p(90)=0s     p(95)=0s      
     http_req_waiting...............: avg=27s     min=0s   med=24.7s  max=59.63s p(90)=43.63s p(95)=57.36s  
     http_reqs......................: 2392   21.748562/s
     iteration_duration.............: avg=32.59s  min=2.1s med=34.48s max=1m0s   p(90)=55.9s  p(95)=58.36s  
     iterations.....................: 2332   21.20303/s
     vus............................: 2      min=2       max=1000
     vus_max........................: 1000   min=1000    max=1000

GetAsync 1000

  data_received..................: 8.0 MB 94 kB/s
     data_sent......................: 1.3 MB 15 kB/s
     http_req_blocked...............: avg=34.18µs min=1µs   med=4µs  max=1.08ms p(90)=15µs p(95)=320µs
     http_req_connecting............: avg=22.62µs min=0s    med=0s   max=659µs  p(90)=0s   p(95)=247µs
     http_req_duration..............: avg=5s      min=4.99s med=5s   max=5.01s  p(90)=5s   p(95)=5s   
       { expected_response:true }...: avg=5s      min=4.99s med=5s   max=5.01s  p(90)=5s   p(95)=5s   
     http_req_failed................: 0.00%  ✓ 0          ✗ 12196 
     http_req_receiving.............: avg=58.91µs min=20µs  med=54µs max=658µs  p(90)=87µs p(95)=101µs
     http_req_sending...............: avg=23.37µs min=6µs   med=18µs max=358µs  p(90)=41µs p(95)=61µs 
     http_req_tls_handshaking.......: avg=0s      min=0s    med=0s   max=0s     p(90)=0s   p(95)=0s   
     http_req_waiting...............: avg=5s      min=4.99s med=5s   max=5.01s  p(90)=5s   p(95)=5s   
     http_reqs......................: 12196  143.460417/s
     iteration_duration.............: avg=6s      min=5.99s med=6s   max=6.01s  p(90)=6s   p(95)=6s   
     iterations.....................: 12196  143.460417/s
     vus............................: 10     min=10       max=1000
     vus_max........................: 1000   min=1000     max=1000


- In the case of the asynchronous action method, we were able to process more requests as compared to the synchronous action method.
- So by increasing the value of min threads in the thread pool( ThreadPool.SetMinThreads(1000, 1000)) we are able to scale ASP.NET Core application.
- By specifying 100 min threads as the default in ThreadPool we specify that if there is a new request and all the threads in the thread pool are busy then it can instantly spawn up to 100 new threads without any delay to better scale ASP.NET Core application.
- This technique to increase the minimum threads in the ThreadPool is like a patchwork and should not be considered as a permanent solution as we don’t want so many threads running when the CPU can only process 16 threads (my machine number) at any given time.
- Also, an increase in the number of threads is an expensive process and should be done with lots of caution as if we end up creating lots of threads then it can consume a lot of memory and can bring an application or system itself to a halt.